In [2]:
import pandas as pd
import matplotlib

In [3]:
df_tag = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\tag.csv"))
df_movie = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\movie.csv"))
df_rating = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\rating.csv"))
df_link = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\link.csv"))
df_genome_tags = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\genome_tags.csv"))
df_genome_scores = pd.DataFrame(pd.read_csv(r"D:\Projects\moveilense\genome_scores.csv"))

In [4]:
df_tag.head()

   userId  movieId            tag            timestamp
0      18     4141    Mark Waters  2009-04-24 18:19:40
1      65      208      dark hero  2013-05-10 01:41:18
2      65      353      dark hero  2013-05-10 01:41:19
3      65      521  noir thriller  2013-05-10 01:39:43
4      65      592      dark hero  2013-05-10 01:41:18

In [5]:
df_movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
df_rating.head()

   userId  movieId  rating            timestamp
0       1        2     3.5  2005-04-02 23:53:47
1       1       29     3.5  2005-04-02 23:31:16
2       1       32     3.5  2005-04-02 23:33:39
3       1       47     3.5  2005-04-02 23:32:07
4       1       50     3.5  2005-04-02 23:29:40

In [7]:
df_link.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [8]:
df_genome_tags.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [9]:
df_genome_scores.head()

   movieId  tagId  relevance
0        1      1    0.02500
1        1      2    0.02500
2        1      3    0.05775
3        1      4    0.09675
4        1      5    0.14675

In [10]:
df_movie.drop('genres', axis=1, inplace=True)
df_rating.drop('timestamp', axis=1, inplace=True)

In [11]:
# Demonstrating sparsity of the data
merged_df = pd.merge(df_movie, df_rating, on="movieId", how='right').iloc[:50]
#merged_df.head(10)
pivoted_df = merged_df.pivot(index="userId", columns="movieId", values='rating')
pivoted_df.head(10)

movieId,2,29,32,47,50,112,151,223,253,260,...,1240,1243,1246,1249,1258,1259,1261,1262,1266,1278
userId,,,,,,,,,,,,,,,,,,,,,
1,3.5,3.5,3.5,3.5,3.5,3.5,4.0,4.0,4.0,4.0,...,4.0,3.0,3.5,4.0,4.0,4.0,3.5,3.5,4.0,4.0

0